#### Terraform Plan Output
   ```
   data.terraform_remote_state.fabric: Reading...
data.terraform_remote_state.fabric: Read complete after 1s
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_A"]: Refreshing state... [id=NpevUXQW4gKLg1eDqg]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_C"]: Refreshing state... [id=kd6pIA5-qJwDn_-8EQ]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_B"]: Refreshing state... [id=S4oG_BGtaA7QkD5RIw]
module.vpn_routing.apstra_datacenter_connectivity_template_interface.vpn: Refreshing state... [id=e15fff92-f193-11f0-8967-617073747261]
null_resource.force_redeploy: Refreshing state... [id=7705170066501854695]
apstra_blueprint_deployment.dc_1: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.force_redeploy must be replaced
-/+ resource "null_resource" "force_redeploy" {
      ~ id       = "7705170066501854695" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "fabric_staging_revision" = "47" -> (known after apply)
        }
    }

  # module.vpn_routing.data.apstra_blueprint_deployment.dc_1 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = "52ffa17c-b092-48ed-9157-d7bb864d5a05"
      + comment                 = (known after apply)
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_C"] will be updated in-place
  ~ resource "apstra_datacenter_routing_policy" "vpn" {
      ~ extra_exports       = [
          ~ {
              ~ prefix = "10.5.0.0/22" -> "10.7.0.0/22"
                # (1 unchanged attribute hidden)
            },
            # (1 unchanged element hidden)
        ]
        id                  = "kd6pIA5-qJwDn_-8EQ"
        name                = "Vendor_C"
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

   ```
   